from fealpy.backend import bm
from fealpy.mesher import NACA0012Mesher
from fealpy.mesh import TriangleMesh

import matplotlib.pyplot as plt


if __name__ == '__main__':
    box = [-0.5, 1.5, -0.3, 0.3]
    h = 0.01
    halos = bm.array([
        [1.0000, 0.00120],
        [0.9500, 0.01027],
        [0.9000, 0.01867],
        [0.8000, 0.03320],
        [0.7000, 0.04480],
        [0.6000, 0.05320],
        [0.5000, 0.05827],
        [0.4000, 0.06000],
        [0.3000, 0.05827],
        [0.2000, 0.05293],
        [0.1500, 0.04867],
        [0.1000, 0.04240],
        [0.0750, 0.03813],
        [0.0500, 0.03267],
        [0.0250, 0.02453],
        [0.0125, 0.01813],
        [0.0000, 0.00000],
        [0.0125, -0.01813],
        [0.0250, -0.02453],
        [0.0500, -0.03267],
        [0.0750, -0.03813],
        [0.1000, -0.04240],
        [0.1500, -0.04867],
        [0.2000, -0.05293],
        [0.3000, -0.05827],
        [0.4000, -0.06000],
        [0.5000, -0.05827],
        [0.6000, -0.05320],
        [0.7000, -0.04480],
        [0.8000, -0.03320],
        [0.9000, -0.01867],
        [0.9500, -0.01027],
        [1.0000, -0.00120],
        [1.00662, 0.0]], dtype=bm.float64)
    singular_points = bm.array([[0, 0], [1.00662, 0.0]], dtype=bm.float64)
    hs = [h / 2, h / 10]  # 奇异点处网格尺寸

    mesher = NACA0012Mesher(halos, box, singular_points)
    mesh = mesher.init_mesh(h, hs, is_quad=0, thickness=h/10, ratio=2.4, size=h/50)

    fig, axes = plt.subplots()
    mesh.add_plot(axes)
    plt.show()



