import numpy as np

argsort_test_data = [
    # 格式:(x, axis, descending, stable, exp)
    # ---------- 1D ----------
    # 一维数组，升序，稳定
    (np.array([5, 3, 1, 6, 7]), -1, False, True, np.array([2, 1, 0, 3, 4])),
    # 一维数组，降序，稳定
    (np.array([5, 3, 1, 6, 7]), -1, True, True, np.array([4, 3, 0, 1, 2])),
    # 一维数组，含重复元素，稳定
    (np.array([2, 2, 1]), -1, False, True, np.array([2, 0, 1])),
    # ---------- 2D ----------
    # 二维数组，沿 axis=1（每行排序），升序，稳定
    (np.array([[3, 1, 2],
               [9, 7, 8]]), 1, False, True,
     np.array([[1, 2, 0],
               [1, 2, 0]])),
    # 二维数组，沿 axis=0（每列排序）， 降序，稳定
    (np.array([[3, 1, 2],
               [9, 7, 8]]), 0, True, True,
     np.array([[1, 1, 1],
               [0, 0, 0]])),
    # ---------- 3D ----------
    # 三维数组，沿最后一个轴排序（axis=-1），升序，稳定
    (np.array([[[3, 1, 2],
                [6, 5, 4]],
               [[9, 7, 8],
                [0, 2, 1]]] ), -1, False, True,
     np.array([[[1, 2, 0],
                [2, 1, 0]],
               [[1, 2, 0],
                [0, 2, 1]]] )),
    # 三维数组，沿 axis=1（对每个“行块”排序），升序，稳定
    (np.array([[[3, 1],
                [6, 5],
                [0, 2]],
               [[9, 7],
                [4, 8],
                [1, 3]]] ), 1, False, True,
     np.array([[[2, 0],
                [0, 2],
                [1, 1]],
               [[2, 2],
                [1, 0],
                [0, 1]]])),
]


sort_test_data = [
    # 格式:(x, axis, descending, stable, exp)
    # ---------- 1D ----------
    # 一维数组，升序，稳定
    (np.array([5, 3, 1, 6, 7]), -1, False, True, np.array([1, 3, 5, 6, 7])),
    # 一维数组，降序，稳定
    (np.array([5, 3, 1, 6, 7]), -1, True, True, np.array([7, 6, 5, 3, 1])),
    # 一维数组，含重复元素，稳定
    (np.array([2, 2, 1]), -1, False, True, np.array([1, 2, 2])),
    # ---------- 2D ----------
    # 二维数组，沿 axis=1（每行排序），升序，稳定
    (np.array([[3, 1, 2],
               [9, 7, 8]]), 1, False, True,
     np.array([[1, 2, 3],
               [7, 8, 9]])),
    # 二维数组，沿 axis=0（每列排序）， 降序，稳定
    (np.array([[3, 1, 2],
               [9, 7, 8]]), 0, True, True,
     np.array([[9, 7, 8],
               [3, 1, 2]])),
    # ---------- 3D ----------
    # 三维数组，沿最后一个轴排序（axis=-1），升序，稳定
    (np.array([[[3, 1, 2],
                [6, 5, 4]],
               [[9, 7, 8],
                [0, 2, 1]]] ), -1, False, True,
     np.array([[[1, 2, 3],
                [4, 5, 6]],
               [[7, 8, 9],
                [0, 1, 2]]] )),
    # 三维数组，沿 axis=1（对每个“行块”排序），升序，稳定
    (np.array([[[3, 1],
                [6, 5],
                [0, 2]],
               [[9, 7],
                [4, 8],
                [1, 3]]] ), 1, False, True,
     np.array([[[0, 1],
                [3, 2],
                [6, 5]],
               [[1, 3],
                [4, 7],
                [9, 8]]])),
]
